// products.js - ملف المنتجات المنفصل

const products = [
    {
        id: 1,
        name: "شاحن ليثيوم 12.6 فولت 3 امبير",
        price: 250,
        images: ["12.6.png", "12.6_2.png", "12.6_3.png"],
        description: "شاحن ليثيوم عالي الجودة بجهد 12.6 فولت وتيار 3 أمبير، مناسب لجميع أنواع بطاريات الليثيوم، مزود بحماية ضد الشورت سيركت و  بمؤشر ضوئي لمعرفة حالة الشحن.",
        stock: 5
    },
    {
        id: 2,
        name: "شاحن ليثيوم 16.8 فولت 3 امبير",
        price: 280,
        images: ["16.8.png", "16.8_2.png"],
        description: "شاحن ليثيوم عالي الجودة بجهد 16.8 فولت وتيار 3 أمبير، مناسب لجميع أنواع بطاريات الليثيوم، مزود بحماية ضد الشورت سيركت و  بمؤشر ضوئي لمعرفة حالة الشحن.",
        stock: 5
    },
    {
        id: 3,
        name: "شاحن ليثيوم 21 فولت 3 امبير",
        price: 280,
        images: ["21.png"],
        description: "شاحن ليثيوم عالي الجودة بجهد 21 فولت وتيار 3 أمبير، مناسب لجميع أنواع بطاريات الليثيوم، مزود بحماية ضد الشورت سيركت و  بمؤشر ضوئي لمعرفة حالة الشحن.",
        stock: 5
    },
    {
        id: 4,
        name: "باور بانك رواتر بكشاف 4 امبير",
        price: 700,
        images: ["pB12.png", "pB12_2.png"],
        description: "باور بانك طورائ لتشغيل الراوتر عند انقطاع التيار الكهربى بشكل تلقائى لعدد ساعات طويلة ومزود بكشاف  ولبمات بيان شحن والشحن التلقائى عند عودة التيار",
        stock: 2
    },
    {
        id: 5,
        name: "باور بانك سخان 4 امبير",
        price: 350,
        images: ["PB3v.png"],
        description: "باور بانك مع سخان مدمج، سعة 4 أمبير، لتشغيل السخان  دون الحاجة الى ادابتور 3 فولت الشحنة الواحدة تكفى شهور طويلة وبة منفذ تايب سى للشحن من اى شاحن موبايل .",
        stock: 7
    },
    {
        id: 6,
        name: "وصلة رواتر على باور بانك موبايل",
        price: 80,
        images: ["Router.png"],
        description: "وصلة تمكنك من تشغيل الراوتر على باور بانك الموبايل، سهلة الاستخدام وتوفر حل عملي لانقطاع الكهرباء.",
        stock: 10
    },
    {
        id: 7,
        name: "DC-LOAD-10AMP-100V",
        price: 450,
        images: ["DC.png", "DC_2.png"],
        description: "جهاز DC LOAD بقدرة 10 أمبير وجهد حتى 100 فولت، مثالي لاختبار مصادر الطاقة والبطاريات،   .",
        stock: 0
    }
];

// جعل المصفوفة متاحة للاستخدام في ملفات أخرى
window.products = products;